import LocalizedStrings from 'react-localization';

const site = ' TODAY TAXI ';
let strings = new LocalizedStrings({
    ru:{
        /*todo: ......................................................... ......:::::: HEADER ::::::......     */
        main: "Главная",
        fuel: "Топливо",
        flights: "Рейсы",
        akcii: "Еда",
        /*todo: ......................................................... ......:::::: FOOTER ::::::......     */
        about: ' О нас',
        contacts: 'Контакты',
        terms: 'Условия использования сайта',
        /*todo: ......................................................... ......:::::: TERMS ::::::......     */
        terms_part1: 'Условия использования сайта',
        terms_part2: "Внимание! Перед просмотром этого сайта внимательно прочитайте данные условия. Если вы не согласны с\n" +
            "                    этими условиями, не используйте этот сайт.",
        terms_part3: "Использование сайта",
        terms_part4: `Сайт ${site} (далее – «${site.trim()}») разрешает вам просматривать и загружать материалы этого сайта
                    (далее – «Сайт») только для личного некоммерческого использования, при условии сохранения вами всей
                    информации об авторском праве и других сведений о праве собственности, содержащихся в исходных
                    материалах и любых их копиях. Запрещается изменять материалы этого Сайта, а также распространять
                    или демонстрировать их в любом виде или использовать их любым другим образом для общественных или
                    коммерческих целей. Любое использование этих материалов на других сайтах или в компьютерных сетях
                    запрещается.`,
        terms_part5: `Oтказ от ответственности`,
        terms_part6: `Материалы и услуги этого сайта предоставляются «как есть» без каких-либо гарантий. ${site} не
                    гарантирует точности и полноты материалов, программ и услуг, предоставляемых на этом Сайте.
                    ${site} в любое время без уведомления может вносить изменения в материалы и услуги, предоставляемые
                    на этом Сайте, а также в упомянутые в них услуги и цены. В случае устаревания материалов и услуг
                    на этом Сайте ${site} не обязуется обновлять их. ${site} ни при каких обстоятельствах не несет
                    ответственности за любой ущерб (включая, но не ограничиваясь ущербом от потери прибыли, данных или
                    от прерывания деловой активности), возникший вследствие использования, невозможности использования
                    или результатов использования этого сайта.`,
        terms_part7: `Регистрация на сайте`,
        terms_part8_1: `Регистрируясь на Сайте, вы соглашаетесь предоставить достоверную и точную информацию о себе и своих
                    контактных данных, а также принимаете условия `,
        terms_part8_2: `пользовательского соглашения`,
        terms_part8_3: `

                    В результате регистрации вы получаете логин и пароль, за безопасность которых вы несете
                    ответственность. Вы также несете ответственность за все действия под вашим логином и паролем на
                    Сайте. В случае утери регистрационных данных вы обязуетесь сообщить нам об этом.`,
        terms_part9: `Обратная связь и комментарии`,
        terms_part10: `Обращаясь к нам или оставляя комментарии на сайте, вы несете ответственность, что данное сообщение
                    не является незаконным, вредоносным, угрожающим, клеветническим, оскорбляет нравственность, нарушает
                    авторские права, пропагандирует ненависть и/или дискриминацию людей по расовому, этническому,
                    половому, религиозному, социальному признакам, содержит оскорбления в адрес конкретных лиц или
                    организаций, а также каким-либо иным образом нарушает действующее законодательство Украины. Вы
                    соглашаетесь, что любое ваше сообщение ${site} может удалять без вашего на то согласия, а также
                    безвозмездно использовать по своему усмотрению. ${site} не несет ответственности за любую информацию,
                    размещенную пользователями Сайта.`,
        terms_part11: `Использование персональных данных`,
        terms_part12_1: `Мы используем различные технологии для сбора и хранения информации, когда вы посещаете сайт ${site}`,
        terms_part12_2: `(подробнее о защите и обработке персональных данных )`,
        terms_part12_3: `Это может включать в себя запись одного или
                    нескольких куки или анонимных идентификаторов. Мы также используем куки и анонимные идентификаторы,
                    когда вы взаимодействуете с услугами, предложенными нашими партнерами, такими как рекламные услуги,
                    например, которые могут появиться на других сайтах.`,
        terms_part13: `Сообщения и рассылки`,
        terms_part14_1: `${site} может направлять вам сообщение в ответ на сообщения (запросы и жалобы), направленные вами
                    через форму обратной связи и в процессе заказа услуг, при управлении заказами,
                    оказании услуг. ${site} осуществляет передачу сообщений в виде email-писем, сообщений в
                    Viber, SMS-сообщений, уведомлений в мобильном приложении, уведомлений в веб-браузере. Вы можете
                    управлять процедурой направления сообщений через соответствующие настройки на Сайте
                    ${site}.`,
        terms_part14_2: `${site} также может направлять вам информационные и маркетинговые рассылки (новости, акции компании,
                    информацию об акциях, промокоды и скидки, персональные рекомендации, персональные скидки и
                    предложения), которые содержат информацию о услугах, рекламные и коммерческие
                    предложения по таким услугам. Информационные и маркетинговые рассылки осуществляются
                    на основе подписки на рассылки, оформленной вами через Сайт или при заказе услуг
                    через Сайт. ${site} осуществляет информационную и маркетинговую рассылку в виде еmail-писем,
                    сообщений в Viber, SMS-сообщений, уведомлений в мобильном приложении, уведомлений в веб-браузере.
                    Вы можете в любой момент отказаться от получения информационных и маркетинговых рассылок – через
                    соответствующие настройки на Сайте ${site}.`,
        terms_part15: `Конкурсы и розыгрыши в соцсетях`,
        terms_part16_1: `Мы проводим конкурсы и розыгрыши на наших страницах в Facebook, Instagram, Twitter, Telegram,
                    YouTube. Победителей определяем в соответствии с правилами каждого конкретного конкурса.
                    Результаты публикуем в сети, где проводился розыгрыш. `,
        terms_part16_2: `В конкурсе могут принимать участие только граждане Украины старше 18 лет. Участники обязаны
                    выполнить все условия конкурса. Личная лента публикаций и страница участника розыгрыша должны
                    быть открытыми. `,
        terms_part16_3: `Чтобы сохранить право на приз, победителю нужно связаться с администрацией страницы в течение
                    месяца и указать свои данные. Чтобы оформить призы в соответствии с законодательством в
                    некоторых конкурсах нам понадобится регистрационный номер учетной карточки налогоплательщика.
                    Детальнее на сайте ${site}`,
    },
    ua: {
        /*todo: ......................................................... ......:::::: HEADER ::::::......     */
        main: "Головна",
        fuel: "Паливо",
        flights: "Рейси",
        akcii: "Зручно",
        /*todo: ......................................................... ......:::::: FOOTER ::::::......     */
        about: ' Про нас',
        contacts: 'Контакти',
        terms: 'Умови використання сайту',
        /*todo: ......................................................... ......:::::: TERMS ::::::......     */
        terms_part1: 'Умови використання сайту',
        terms_part2: "Увага! Перед переглядом цього сайту уважно прочитайте ці умови. Якщо ви не згодні з\n" +
            " цими умовами не використовуйте цей сайт.",
        terms_part3: "Використання сайту",
        terms_part4: `Сайт ${site} (далі – «${site.trim()}») дозволяє вам переглядати та завантажувати матеріали цього сайту
                    (Далі – «Сайт») тільки для особистого некомерційного використання, за умови збереження вами всієї
                    інформації про авторське право та інші відомості про право власності, що містяться у вихідних
                    матеріалах та будь-яких їх копіях. Забороняється змінювати матеріали цього Сайту, а також розповсюджувати
                    або демонструвати їх у будь-якому вигляді або використовувати їх будь-яким іншим чином для суспільних або
                    комерційних цілей. Будь-яке використання цих матеріалів на інших сайтах чи комп'ютерних мережах
                    забороняється.`,
        terms_part5: `Відмова від відповідальності`,
        terms_part6: `Матеріали та послуги цього сайту надаються «як є» без будь-яких гарантій. ${site} не
                    гарантує точності та повноти матеріалів, програм та послуг, що надаються на цьому Сайті.
                    ${site} в будь-який час без попередження може вносити зміни до матеріалів та послуг, що надаються
                    на цьому Сайті, а також у згадані в них послуги та ціни. У разі застаріння матеріалів та послуг
                    на цьому Сайті ${site} не зобов'язується оновлювати їх. ${site} за жодних обставин не несе
                    відповідальності за будь-яку шкоду (включаючи, але не обмежуючись збитком від втрати прибутку, даних або
                    від переривання ділової активності), що виник внаслідок використання, неможливості використання
                    або результати використання цього сайту.`,
        terms_part7: `Реєстрація на сайті`,
        terms_part8_1: `Реєструючись на Сайті, ви погоджуєтесь надати достовірну та точну інформацію про себе та своїх
                     контактних даних, а також приймаєте умови `,
        terms_part8_2: `Користувальницької угоди`,
        terms_part8_3: `
                    В результаті реєстрації ви отримуєте логін та пароль, за безпеку яких ви несете
                     відповідальність. Ви також несете відповідальність за всі дії під вашим логіном та паролем на
                     Сайт. У разі втрати реєстраційних даних ви зобов'язуєтесь повідомити про це нам.`,
        terms_part9: `Зворотній зв'язок та коментарі`,
        terms_part10: `Звертаючись до нас або залишаючи коментарі на сайті, ви несете відповідальність, що це повідомлення
                    не є незаконним, шкідливим, загрозливим, наклепницьким, ображає моральність, порушує
                    авторські права, пропагує ненависть та/або дискримінацію людей за расовим, етнічним,
                    статевим, релігійним, соціальним ознаками, містить образи на адресу конкретних осіб або
                    організацій, а також якимось іншим чином порушує чинне законодавство України. Ви
                    погоджуєтесь, що будь-яке ваше повідомлення ${site} може видаляти без вашої на те згоди, а також
                    безоплатно використовувати на власний розсуд. ${site} не несе відповідальності за будь-яку інформацію,
                    розміщену користувачами Сайту.`,
        terms_part11: `Використання персональних даних`,
        terms_part12_1: `Ми використовуємо різні технології для збирання та зберігання інформації, коли ви відвідуєте сайт ${site}`,
        terms_part12_2: `(докладніше про захист та обробку персональних даних)`,
        terms_part12_3: `Це може включати запис одного або
                     кількох куки або анонімних ідентифікаторів. Ми також використовуємо cookie та анонімні ідентифікатори,
                     коли ви взаємодієте з послугами, запропонованими нашими партнерами, такими як рекламні послуги,
                     наприклад, які можуть з'явитись на інших сайтах.`,
        terms_part13: `Повідомлення та розсилки`,
        terms_part14_1: `${site} може надсилати вам повідомлення у відповідь на повідомлення (запити та скарги), надіслані вами
                     через форму зворотного зв'язку та в процесі замовлення послуг, при керуванні замовленнями,
                     надання послуг. ${site} здійснює передачу повідомлень у вигляді email-листів, повідомлень у
                     Viber, SMS-повідомлень, повідомлень у мобільному додатку, повідомлень у веб-браузері. Ви можете
                     керувати процедурою надсилання повідомлень через відповідні налаштування на Сайті
                     ${site}.`,
        terms_part14_2: `${site} також може надсилати вам інформаційні та маркетингові розсилки (новини, акції компанії,
                    інформацію про акції, промокоди та знижки, персональні рекомендації, персональні знижки та
                    пропозиції), які містять інформацію про послуги, рекламні та комерційні
                    пропозиції щодо таких послуг. Інформаційні та маркетингові розсилки здійснюються
                    на основі підписки на розсилки, оформленої вами через Сайт або при замовленні послуг
                    через сайт. ${site} здійснює інформаційну та маркетингову розсилку у вигляді еmail-листів,
                    повідомлень у Viber, SMS-повідомлень, повідомлень у мобільному додатку, повідомлень у веб-браузері.
                    Ви можете будь-якої миті відмовитися від отримання інформаційних та маркетингових розсилок – через
                    відповідні налаштування на сайті ${site}.`,
        terms_part15: `Конкурси та розіграші у соцмережах`,
        terms_part16_1: `Ми проводимо конкурси та розіграші на наших сторінках у Facebook, Instagram, Twitter, Telegram,
                     YouTube. Переможців визначаємо відповідно до правил кожного конкретного конкурсу.
                     Результати публікуємо у мережі, де проводився розіграш. `,
        terms_part16_2: `У конкурсі можуть брати участь лише громадяни України віком від 18 років. Учасники зобов'язані
                     виконати усі умови конкурсу. Особиста стрічка публікацій та сторінка учасника розіграшу мають
                     бути відкритими.`,
        terms_part16_3: `Щоб зберегти право на приз, переможцю потрібно зв'язатися з адміністрацією сторінки протягом
                     місяця та вказати свої дані. Щоб оформити призи відповідно до законодавства у
                     У деяких конкурсах нам знадобиться реєстраційний номер облікової картки платника податків.
                     Детальніше на сайті ${site}`,

    }
});
export default strings;